rocksdb/experiments/M1/results/20260428-125951/db_bench.log
RocksDB:    version 8.11.3
Date:       Tue Apr 28 12:59:51 2026
CPU:        16 * Intel(R) Xeon(R) Gold 5320 CPU @ 2.20GHz
CPUCache:   16384 KB
Set seed to 1777381191831855 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       16 bytes each (+ 0 bytes user-defined timestamp)
Values:     1024 bytes each (512 bytes after compression)
Entries:    1000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    991.8 MB (estimated)
FileSize:   503.5 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
DB path: [rocksdbtest/dbbench]
fillrandom   :       6.376 micros/op 156834 ops/sec 6.376 seconds 1000000 operations;  155.6 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :       4.893 micros/op 204354 ops/sec 4.893 seconds 1000000 operations;  202.7 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :       5.792 micros/op 172651 ops/sec 5.792 seconds 1000000 operations;  171.2 MB/s
DB path: [rocksdbtest/dbbench]
compact      : 8131559.000 micros/op 0 ops/sec 8.132 seconds 1 operations;


** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      0/0    0.00 KB   0.0      0.0     0.0      0.0       2.9      2.9       0.0   1.0      0.0    470.7      6.22              4.44        49    0.127       0      0       0.0       0.0
  L1      0/0    0.00 KB   0.0      5.0     2.9      2.2       3.8      1.6       0.0   1.3    379.4    286.3     13.59             10.15         8    1.699   5124K  1257K       0.0       0.0
  L2     16/0   956.32 MB   0.4      2.7     1.2      1.6       2.1      0.5       0.4   1.7    343.1    256.9      8.19              7.00        11    0.744   2791K   701K       0.0       0.0
 Sum     16/0   956.32 MB   0.0      7.8     4.0      3.7       8.7      5.0       0.4   3.0    284.5    318.7     27.99             21.59        68    0.412   7916K  1958K       0.0       0.0
 Int      0/0    0.00 KB   0.0      7.5     3.8      3.7       8.1      4.4       0.4   3.3    290.6    313.7     26.57             20.46        61    0.436   7674K  1937K       0.0       0.0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0      7.8     4.0      3.7       5.9      2.1       0.0   0.0    365.8    275.3     21.78             17.15        19    1.146   7916K  1958K       0.0       0.0
High      0/0    0.00 KB   0.0      0.0     0.0      0.0       2.9      2.9       0.0   0.0      0.0    470.7      6.22              4.44        49    0.127       0      0       0.0       0.0

Blob file count: 0, total size: 0.0 GB, garbage size: 0.0 GB, space amp: 0.0

Uptime(secs): 25.2 total, 22.2 interval
Flush(GB): cumulative 2.858, interval 2.502
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 8.71 GB write, 353.99 MB/s write, 7.78 GB read, 316.04 MB/s read, 28.0 seconds
Interval compaction: 8.14 GB write, 375.54 MB/s write, 7.54 GB read, 347.92 MB/s read, 26.6 seconds
Write Stall (count): cf-l0-file-count-limit-delays-with-ongoing-compaction: 0, cf-l0-file-count-limit-stops-with-ongoing-compaction: 0, l0-file-count-limit-delays: 0, l0-file-count-limit-stops: 0, memtable-limit-delays: 0, memtable-limit-stops: 0, pending-compaction-bytes-delays: 0, pending-compaction-bytes-stops: 0, total-delays: 0, total-stops: 0
Block cache LRUCache@0x55df431c8df0#41619 capacity: 32.00 MB seed: 1318179119 usage: 0.09 KB table_size: 1024 occupancy: 1 collections: 1 last_copies: 1 last_secs: 0.000239 secs_since: 25
Block cache entry stats(count,size,portion): Misc(1,0.00 KB,0%)

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 25.2 total, 22.2 interval
Cumulative writes: 3000K writes, 3000K keys, 3000K commit groups, 1.0 writes per commit group, ingest: 2.95 GB, 119.88 MB/s
Cumulative WAL: 3000K writes, 0 syncs, 3000000.00 writes per sync, written: 2.95 GB, 119.88 MB/s
Cumulative stall: 00:00:0.000 H:M:S, 0.0 percent
Interval writes: 2564K writes, 2564K keys, 2564K commit groups, 1.0 writes per commit group, ingest: 2582.81 MB, 116.37 MB/s
Interval WAL: 2564K writes, 0 syncs, 2564650.00 writes per sync, written: 2.52 GB, 116.37 MB/s
Interval stall: 00:00:0.000 H:M:S, 0.0 percent
Write Stall (count): write-buffer-manager-limit-stops: 0